lkolbly/cmsis-svd/data/TexasInstruments/LM3S3748.svd
        <register>
          <name>_1_CTL</name>
          <description>PWM1 Control</description>
          <addressOffset>0x00000080</addressOffset>
        </register>
        <register>
          <name>_1_INTEN</name>
          <description>PWM1 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000084</addressOffset>
        </register>
        <register>
          <name>_1_RIS</name>
          <description>PWM1 Raw Interrupt Status</description>
          <addressOffset>0x00000088</addressOffset>
        </register>
        <register>
          <name>_1_ISC</name>
          <description>PWM1 Interrupt Status and Clear</description>
          <addressOffset>0x0000008C</addressOffset>
        </register>
        <register>
          <name>_1_LOAD</name>
          <description>PWM1 Load</description>
          <addressOffset>0x00000090</addressOffset>
        </register>
        <register>
          <name>_1_COUNT</name>
          <description>PWM1 Counter</description>
          <addressOffset>0x00000094</addressOffset>
        </register>
        <register>
          <name>_1_CMPA</name>
          <description>PWM1 Compare A</description>
          <addressOffset>0x00000098</addressOffset>
        </register>
        <register>
          <name>_1_CMPB</name>
          <description>PWM1 Compare B</description>
          <addressOffset>0x0000009C</addressOffset>
        </register>
        <register>
          <name>_1_GENA</name>
          <description>PWM1 Generator A Control</description>
          <addressOffset>0x000000A0</addressOffset>
        </register>
        <register>
          <name>_1_GENB</name>
          <description>PWM1 Generator B Control</description>
          <addressOffset>0x000000A4</addressOffset>
        </register>
        <register>
          <name>_1_DBCTL</name>
          <description>PWM1 Dead-Band Control</description>
          <addressOffset>0x000000A8</addressOffset>
        </register>
        <register>
          <name>_1_DBRISE</name>
          <description>PWM1 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x000000AC</addressOffset>
        </register>
        <register>
          <name>_1_DBFALL</name>
          <description>PWM1 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x000000B0</addressOffset>
        </register>
        <register>
          <name>_1_FLTSRC0</name>
          <description>PWM1 Fault Source 0</description>
          <addressOffset>0x000000B4</addressOffset>
        </register>
        <register>
          <name>_1_MINFLTPER</name>
          <description>PWM1 Minimum Fault Period</description>
          <addressOffset>0x000000BC</addressOffset>
        </register>
        <register>
          <name>_2_CTL</name>
          <description>PWM2 Control</description>
          <addressOffset>0x000000C0</addressOffset>
        </register>
        <register>
          <name>_2_INTEN</name>
          <description>PWM2 Interrupt and Trigger Enable</description>
          <addressOffset>0x000000C4</addressOffset>
        </register>
        <register>
          <name>_2_RIS</name>
          <description>PWM2 Raw Interrupt Status</description>
          <addressOffset>0x000000C8</addressOffset>
        </register>
        <register>
          <name>_2_ISC</name>
          <description>PWM2 Interrupt Status and Clear</description>
          <addressOffset>0x000000CC</addressOffset>
        </register>
        <register>
          <name>_2_LOAD</name>
          <description>PWM2 Load</description>
          <addressOffset>0x000000D0</addressOffset>
        </register>
        <register>
          <name>_2_COUNT</name>
          <description>PWM2 Counter</description>
          <addressOffset>0x000000D4</addressOffset>
        </register>
        <register>
          <name>_2_CMPA</name>
          <description>PWM2 Compare A</description>
          <addressOffset>0x000000D8</addressOffset>
        </register>
        <register>
          <name>_2_CMPB</name>
          <description>PWM2 Compare B</description>
          <addressOffset>0x000000DC</addressOffset>
        </register>
        <register>
          <name>_2_GENA</name>
          <description>PWM2 Generator A Control</description>
          <addressOffset>0x000000E0</addressOffset>
        </register>
        <register>
          <name>_2_GENB</name>
          <description>PWM2 Generator B Control</description>
          <addressOffset>0x000000E4</addressOffset>
        </register>
        <register>
          <name>_2_DBCTL</name>
          <description>PWM2 Dead-Band Control</description>
          <addressOffset>0x000000E8</addressOffset>
        </register>
        <register>
          <name>_2_DBRISE</name>
          <description>PWM2 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x000000EC</addressOffset>
        </register>
        <register>
          <name>_2_DBFALL</name>
          <description>PWM2 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x000000F0</addressOffset>
        </register>
        <register>
          <name>_2_FLTSRC0</name>
          <description>PWM2 Fault Source 0</description>
          <addressOffset>0x000000F4</addressOffset>
        </register>
        <register>
          <name>_2_MINFLTPER</name>
          <description>PWM2 Minimum Fault Period</description>
          <addressOffset>0x000000FC</addressOffset>
        </register>
        <register>
          <name>_3_CTL</name>
          <description>PWM3 Control</description>
          <addressOffset>0x00000100</addressOffset>
        </register>
        <register>
          <name>_3_INTEN</name>
          <description>PWM3 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000104</addressOffset>
        </register>
        <register>
          <name>_3_RIS</name>
          <description>PWM3 Raw Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
        </register>
        <register>
          <name>_3_ISC</name>
          <description>PWM3 Interrupt Status and Clear</description>
          <addressOffset>0x0000010C</addressOffset>
        </register>
        <register>
          <name>_3_LOAD</name>
          <description>PWM3 Load</description>
          <addressOffset>0x00000110</addressOffset>
        </register>
        <register>
          <name>_3_COUNT</name>
          <description>PWM3 Counter</description>
          <addressOffset>0x00000114</addressOffset>
        </register>
        <register>
          <name>_3_CMPA</name>
          <description>PWM3 Compare A</description>
          <addressOffset>0x00000118</addressOffset>
        </register>
        <register>
          <name>_3_CMPB</name>
          <description>PWM3 Compare B</description>
          <addressOffset>0x0000011C</addressOffset>
        </register>
        <register>
          <name>_3_GENA</name>
          <description>PWM3 Generator A Control</description>
          <addressOffset>0x00000120</addressOffset>
        </register>
        <register>
          <name>_3_GENB</name>
          <description>PWM3 Generator B Control</description>
          <addressOffset>0x00000124</addressOffset>
        </register>
        <register>
          <name>_3_DBCTL</name>
          <description>PWM3 Dead-Band Control</description>
          <addressOffset>0x00000128</addressOffset>
        </register>
        <register>
          <name>_3_DBRISE</name>
          <description>PWM3 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x0000012C</addressOffset>
        </register>
        <register>
          <name>_3_DBFALL</name>
          <description>PWM3 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x00000130</addressOffset>
        </register>
        <register>
          <name>_3_FLTSRC0</name>
          <description>PWM3 Fault Source 0</description>
          <addressOffset>0x00000134</addressOffset>
        </register>
        <register>
          <name>_3_MINFLTPER</name>
          <description>PWM3 Minimum Fault Period</description>
          <addressOffset>0x0000013C</addressOffset>
        </register>
        <register>
          <name>_0_FLTSEN</name>
          <description>PWM0 Fault Pin Logic Sense</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>PWM_X_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSTAT0</name>
          <description>PWM0 Fault Status 0</description>
          <addressOffset>0x00000804</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_FLTSEN</name>
          <description>PWM1 Fault Pin Logic Sense</description>
          <addressOffset>0x00000880</addressOffset>
        </register>
        <register>
          <name>_1_FLTSTAT0</name>
          <description>PWM1 Fault Status 0</description>
          <addressOffset>0x00000884</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>_2_FLTSEN</name>
          <description>PWM2 Fault Pin Logic Sense</description>
          <addressOffset>0x00000900</addressOffset>
        </register>
        <register>
          <name>_2_FLTSTAT0</name>
          <description>PWM2 Fault Status 0</description>
          <addressOffset>0x00000904</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>_3_FLTSEN</name>
          <description>PWM3 Fault Pin Logic Sense</description>
          <addressOffset>0x00000980</addressOffset>
        </register>
        <register>
          <name>_3_FLTSTAT0</name>
          <description>PWM3 Fault Status 0</description>
          <addressOffset>0x00000984</addressOffset>
          <access>read-only</access>
        </register>
